package lesson_08;

public class App {
    public static void main(String[] args) {


        /**
         * Игра BlackJack
         * Цель заключается в том, чтобы набрать как можно больше очков, но не более 21 и обыграть нужно крупье.
         * В игре используется от одной до восьми колод. Из-за того что вероятность комбинации блек-джек при большем
         * числе колод ниже, то преимущество игрока уменьшается при увеличении числа колод. При игре с шаффл-машинкой
         * считается, что используется бесконечная колода.
         *
         * Значения очков каждой карты:
         * от двойки до десятки — от 2 до 10 соответственно;
         * у туза — 1 или 11 (11 пока общая сумма не больше 21, далее 1);
         * у т. н. картинок (король, дама, валет) — 10;
         *
         * Если у игрока и дилера число очков на руках равное, то такая ситуация называется «ровно»: за рубежом это
         * называется — пуш (англ. push). В такой ситуации все остаются при своих ставках, никто не выигрывает и не
         * проигрывает. Хотя в казино бывают исключения, и при «push» выигрывает казино
         */
    }
}
