package lesson_02.homework_02;

public class SquareAre {
    public static void main(String[] args) {
        // Задача 2. Дано: Стороны квадрата a = 50, b = 20. Найти площадь.

        int a = 50;
        int b = 20;

        int are = a * b;

        System.out.println("Площадь равна " + are); //Это не квадрат, а прямоугольник

    }
}
